import { Divider, List, Typography } from 'antd';

const data = [
  '[28.03.2022] Вам запрапоновано відсоткову ставку - 12%. Для підтвердження чи відхилення перейдіть до меню вище.',
  '[18.07.2022] Ваша заявка на позику успішно розглянута та проінвестована.',
  '[13.06.2022] По вашій заявці на позику запропонували новий термін виплати.',
  '[06.07.2022] Ви вчасно сплачуєте внески по кредитак, ваш рейтинг росте.',
  '[06.07.2022] На вашу завку відгунулось декілька інвесторів. Пропонуємо провести аукціон.',

  '[28.03.2022] Ви запрапоновували відсоткову ставку - 15%. Чекаємо підтведження від позичальника.',
  '[18.07.2022] Ви успішно проінвестували позику від Коломиї Василя.',
  '[13.06.2022] По заявці на позику, яку ви розглядали запропонували новий термін виплати.',
  '[07.07.2022] Цього місяця ви отримали рекордну суму виплат від позичальників',
  '[06.07.2022] Завкою, на яку ви відгунулись, ще декілька інвесторів зацікавились. ',

  '[06.07.2022] Якщо ви це читаєте, припускаємо, що вам вже немає на що дивитись на нашому сайті..',
];

export const Messages = () => {
  return (
    <>
      <Divider orientation="left">Ваші сповіщення</Divider>
      <List
        header={<div>Нові повідомлення</div>}
        bordered
        dataSource={data}
        renderItem={(item) => (
          <List.Item>
            <Typography.Text mark>[msg]</Typography.Text> {item}
          </List.Item>
        )}
      />
    </>
  );
};
